src/cf/InformationRegisters/ОчередьСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЗаписанВЖурнал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьСообщений/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
 
 // Процедура, записывает событие в журнал.
 //
 Процедура ЗаписатьОчередьСообщений(Сообщение) Экспорт   
 
     Движения = РегистрыСведений.ОчередьСообщений.СоздатьМенеджерЗаписи();
     ГЧС = Новый ГенераторСлучайныхЧисел();
     Движения.Период                    = ТекущаяДатаСеанса() + ГЧС.СлучайноеЧисло(1,1000000);
     Движения.ЗаписанВЖурнал            = Ложь;
     Движения.Сообщение                 = Сообщение;       
     Движения.Записать(Ложь);
     
 КонецПроцедуры
 
 #КонецОбласти
